// 017_Class.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

// 내가 만들고 싶은게 생각났다 => 바로 클래스
// 객체지향
// 객체지향을 배웠다 => 개념 자체를 모르는 것.

// 내용은 나중에 채워도 되거나
// 혹은 숙련된 프로그래머에게 채워달라고 하거나.

// 컴퓨터는 하나도 몰라...

    // 사물의 특성과 행동을 하나로 모아서 표현할수 있는 문법이 있어야 합니다.
    // 사물 => 모든것 드래곤
    // 특성 => 변수   방어력
    // 행동 => 함수   불을뿜는다.

    // 그 문법을 기반으로 만들어진 n바이트 이상의 크기를 가지는 메모리를
    // => 객체라고 합니다


// c++이 사물의 특성과 행동을 하나로 모아서 표현할수 있는 문법 => class
// 사물중 게임을 표현하기 위한 class
// 문법은 아직 만들어지지 않은 겁니다.
// 사용자 정의 자료형이라고 합니다.
class MyGame 
{
    // 특성 => 변수
    int Score;

    // 행동 => 함수
	void DisplayScreen() 
	{

	}
};

// 클래스는
// 뭐든지 만들수 있는 문법이기때문에


int main()
{
    // 자료형
    int       NewInt;

    // 자료형 이름
    // 객체화라고 합니다.
    MyGame    NewGame;

    
}
